Courses/4420/Lectures/Fortification/AccessControl/android-permissions.org
# -*- mode: org -*-
#+DATE: 2014-07-09
#+TITLE: Android Permissions
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:nil
#+HTML_LINK_HOME: ../../
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+DESCRIPTION: Android Internals and Security
#+BIND: org-html-preamble-format (("en" "%d <a href=\"../../Top/\"> TOP</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2015 %e &bull; <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> %d"))
#+STARTUP:showeverything

* Lecture

   3. [[./android-permissions-demystified-slides.pdf][slides]]  from the Android Permissions Demystified paper.
   4. Permission Manager apps on Google Play https://play.google.com/store/search?q=permission
   5. [[http://forum.xda-developers.com/xposed/][Xposed Framework]] to change permissions of installed APKs.
   6. [[http://forum.xda-developers.com/xposed/modules/][XPrivacy]] module for the above.

* Android Permissions

1. Package Manager CLI =pm= is built-in; full path =/system/bin/pm=
1. =root@generic:/ # pm list permissions= lists all permissions.
1. The list evolves from one Android version to next.
1. http://www.cheatography.com/citguy/cheat-sheets/android-package-manager-pm/

* References

1. http://www.cs.berkeley.edu/~emc/papers/android_permissions.pdf.
   Required Reading.

1. http://developer.android.com/guide/topics/security/permissions.html;
   http://developer.android.com/reference/android/Manifest.permission.html
   Required Reading.
