Courses/4420/Lectures/Fortification/AccessControl/android-permissions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Android Permissions</title>
<!-- 2015-08-24 Mon 14:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Android Internals and Security"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
2014-07-09 <a href="../../Top/"> TOP</a>
</div>
<div id="content">
<h1 class="title">Android Permissions</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lecture</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="./android-permissions-demystified-slides.pdf">slides</a>  from the Android Permissions Demystified paper.
</li>
<li>Permission Manager apps on Google Play <a href="https://play.google.com/store/search?q=permission">https://play.google.com/store/search?q=permission</a>
</li>
<li><a href="http://forum.xda-developers.com/xposed/">Xposed Framework</a> to change permissions of installed APKs.
</li>
<li><a href="http://forum.xda-developers.com/xposed/modules/">XPrivacy</a> module for the above.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Android Permissions</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Package Manager CLI <code>pm</code> is built-in; full path <code>/system/bin/pm</code>
</li>
<li><code>root@generic:/ # pm list permissions</code> lists all permissions.
</li>
<li>The list evolves from one Android version to next.
</li>
<li><a href="http://www.cheatography.com/citguy/cheat-sheets/android-package-manager-pm/">http://www.cheatography.com/citguy/cheat-sheets/android-package-manager-pm/</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="http://www.cs.berkeley.edu/~emc/papers/android_permissions.pdf">http://www.cs.berkeley.edu/~emc/papers/android_permissions.pdf</a>.
Required Reading.
</li>

<li><a href="http://developer.android.com/guide/topics/security/permissions.html">http://developer.android.com/guide/topics/security/permissions.html</a>;
<a href="http://developer.android.com/reference/android/Manifest.permission.html">http://developer.android.com/reference/android/Manifest.permission.html</a>
Required Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> 2014-07-09
</div>
</body>
</html>
